//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "DxLib.h"
#include "SceneManager.h"
#include "Screen.h"
#include "Fps.h"
#include "ModelManager.h"

//-----------------------------------------------------------------------------
//	@brief	メイン処理
//-----------------------------------------------------------------------------
int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int)
{
	// 垂直同期を使用しない
	SetWaitVSyncFlag(FALSE);

	// これを入れないとシェーダーが使えない
	SetUseDirect3DVersion(DX_DIRECT3D_9EX);

	// ＤＸライブラリ初期化処理
	if (DxLib_Init() == -1)
	{
		return -1;	// エラーが起きたら直ちに終了
	}

	// 画面モードのセット
	SetGraphMode(SCREEN_WIDTH, SCREEN_HEIGHT, 32);
	ChangeWindowMode(FALSE);

	// 描画先を裏画面に設定
	SetDrawScreen(DX_SCREEN_BACK);

	//-----------------------------------------------------------------------------
	// シーンマネージャーインスタンス
	//-----------------------------------------------------------------------------

	SceneManager sceneMgr;

	sceneMgr.Initialize();	// 初期化

	//-----------------------------------------------------------------------------
	// FPS制御クラスインスタンス
	//-----------------------------------------------------------------------------

	Fps fps;

	ModelManager::GetInstance();      // モデル管理クラスの生成

	//-----------------------------------------------------------------------------
	// メインループ
	//-----------------------------------------------------------------------------
	while (ScreenFlip() == 0 && ProcessMessage() == 0 && ClearDrawScreen() == 0 &&
		CheckHitKey(KEY_INPUT_ESCAPE) == 0)
	{
		fps.Update();		// FPS処理

		clsDx();			// 簡易画面出力をクリア

		sceneMgr.Update();	// シーン処理

		sceneMgr.Draw();	// シーン描画
		
		fps.Wait();			// FPS制御のための停止処理
	}

	DxLib_End();			// ＤＸライブラリ使用の終了処理

	return 0;				// ソフトの終了 
}